//кнопки start
export const buttons_for_managers = [
  [{ text: '🏆Таблица лидеров🏆' }],
  [{ text: '⚡Мои закрытия' }, { text: '❤️‍🔥Моя команда' }],
  [{ text: 'Написать обращение' }],
];

export const buttons_for_admins = [
  [{ text: '🏆Таблица лидеров🏆' }],
  [{ text: '❤️‍🔥Моя команда' }, { text: '⚡Статистика' }],
  [{ text: '✏️Редактировать месяц' }],
];

export const buttons_for_ROP = [
  [{ text: '🏆Таблица лидеров🏆' }],
  [{ text: 'Сотрудники' }, { text: 'Руководители групп' }],
  [{ text: '✏️Редактировать месяц' }],
]

export const managerMap: { [key: string]: string } = {
  Сергей: 'Сергей Кириллов',
  Катя: 'Катя Рафикова',
  Диана: 'Диана Тагирова',
  Ишкуватов: 'Ишкуватов Артур',
  Камилла: 'Камилла',
  Тимофей: 'Тимофей Иванов',
  Ринат: 'Ринат Шарифуллин',
  Алсу: 'Алсу Салимова',
  Денис: 'Денис Иштуганов',
  Арман: 'Арман Кузембаев',
  Алиса: 'Алиса',
  "Эльвина Максимова": 'Эльвина Максимова',
  Рамиль: 'Рамиль Ахмадеев',
  Виктор: 'Виктор Тест',
  Зифа: 'Зифа Хамидуллина',
  Радмир: 'Радмир Байрамгулов',
  Савелий: 'Савелий Потапов',
  Галина: 'Галина Гладкова',
  Ксения: 'Ксения Чуфенева',
  Екатерина: 'Екатерина Bekasova',
  Альфира: 'Альфира Кабылова',
  Аня: 'Аня Кириллова',
  Анна: 'Анна Антонова',
  Афанасий: 'Афанасий Антонов',
  Ната: "Ната Ковтун",
  Георгий: "Георгий Елисеев",
  Ирина: "Ирина Шилина",
  Елена: "Елена Большаева",
  Oksana: "Oksana Панченкова",
  Динара: "Динара Катунина",
  Роман: "Роман Олейников",
  Иван: "Иван Артамонов",
  Pavel: "Pavel Франчишин"
};

export const managerFullNameMap: { [key: string]: string } = {
  'Анастасия Иванова / Куратор': 'Анастасия Иванова',
  'Камилла Камилла Наилевна': 'Камилла Наилевна',
  Алиса: 'Aлиса Ахмерова',
  Эльвина: 'Эльвина Максимова',
  Зифа: 'Зифа Хамидуллина',
  'Екатерина Bekasova': 'Екатерина Бекасова',
};

export const monthNames = [
  'Январь',
  'Февраль',
  'Март',
  'Апрель',
  'Май',
  'Июнь',
  'Июль',
  'Август',
  'Сентябрь',
  'Октябрь',
  'Ноябрь',
  'Декабрь',
];
//my-sales.command.ts
